Конфигурация/DataProcessors/гкс_ПриемкаТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>гкс_ПриемкаТранспорта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>гкс_СвязьРегистрацииИТранспортногоДокумента</Name>
			<Comment>Транспортные документы регистрации</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранспортныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ТранспортныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесПринят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесНеПринят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоПоПревышениюМаксимальногоВеса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтборуПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаРазрешена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Убыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибылАвторизован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВесахБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыПробыАвторизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаРазрешенаАвторизован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженАвторизован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВесахТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогрузкаРазрешена</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
					<Comment>гкс+ [ERP-2178]</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/гкс_ТипыТранспортныхСредствДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_ТипыТранспортныхСредствДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самолёт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трубопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/гкс_НазначенияИспользованияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_НазначенияИспользованияКачества</Name>
			<Comment>ERP-2184</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлеваторВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛаборантВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпозитВнешниеПробыНаТысячуТон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/гкс_ТранспортныйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>гкс_ТранспортныйДокумент</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.гкс_ЖДНакладныеВагона</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРазгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВеса</Name>
					<Comment>Ед.измерения веса в документе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДокументПЛК</Name>
					<Comment>Документ создан в текущей базе</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПогрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРазгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесТары</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесБрутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОВодителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/DataProcessors/гкс_ПриемкаТранспорта/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДанныеДляДетальныхЗаписей(ДокументРегистрации, ДокументРегистрацииАнализов) Экспорт
	
	Результат = Новый Структура;
	
	Запрос	= Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДляДетальныхЗаписей();  
	
	Запрос.УстановитьПараметр("Ссылка", ДокументРегистрации);
	Запрос.УстановитьПараметр("СсылкаАнализов", ДокументРегистрацииАнализов);
	
	ПакетныйРезультат	= Запрос.ВыполнитьПакет();
	
	ДанныеРегистрацииВТаблице = ПакетныйРезультат[0].Выгрузить();
	Результат.Вставить("ДанныеРегистрации", 
	                      ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеРегистрацииВТаблице[0]));
	
	Результат.Вставить("КачественныеПоказатели", ПакетныйРезультат[1].Выгрузить());
	
	Возврат Результат;
	
КонецФункции

// Формирует транспортный документ и основание движения запасов при установлении состояния "убыл"
//
// Параметры:
//  ДокументРегистрации  - ДокументСсылка.гкс_РегистрацияНаПЛК - документ регистрации транспорта
//            
//  ПараметрыРегистрации  - Структура - данные регитсрации
//               
//
Процедура СформироватьКомплектДокументовПриемкиИЗарегистрироватьУбытиеТранспорта(ДокументРегистрации, ПараметрыРегистрации) Экспорт
	 
	ПараметрыФормированияКомплектаДокументов = ПараметрыФормированияКомплектаДокументов(
		ДокументРегистрации, ПараметрыРегистрации);
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьТаблицуДокументовПриемкиПоРегистрации(ДокументРегистрации);
		
		ТранспортныйДокумент = Документы.гкс_ТранспортныйДокумент.
			СформироватьТранспортныйДокументПоНеобходимости(ДокументРегистрации);
			
		Если ЗначениеЗаполнено(ТранспортныйДокумент) Тогда
			
			ПараметрыФормированияКомплектаДокументов.Вставить("ТранспортныйДокумент", ТранспортныйДокумент);
			
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("ДокументРегистрации", ДокументРегистрации);
			СтруктураЗаписи.Вставить("ТранспортныйДокумент", ТранспортныйДокумент);
			СтруктураЗаписи.Вставить("ТранспортноеСредство", ПараметрыФормированияКомплектаДокументов.ТранспортноеСредство);
			
			гкс_ПриемкаТранспорта.УстановитьСвязьРегистрацииИТранспортногоДокумента(СтруктураЗаписи);
		КонецЕсли;
					
		ОснованиеДляДвиженияЗапасов = Документы.гкс_ОснованиеДляДвиженияЗапасов
			.СформироватьДокументПоНеобходимости(ДокументРегистрации, ПараметрыФормированияКомплектаДокументов);
														  
		гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(
			ДокументРегистрации, Перечисления.гкс_СостоянияРегистрации.Убыл);
	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьУдалениеСвязиРегистрацииИТранспортногоДокумента(ДокументРегистрации) Экспорт
	
	НачатьТранзакцию();
	Попытка		
		ЗаблокироватьТаблицуДокументовПриемкиПоРегистрации(ДокументРегистрации);							
		гкс_ПриемкаТранспорта.УдалитьСвязьРегистрацииИТранспортногоДокумента(
			Новый Структура("ДокументРегистрации", ДокументРегистрации));	
	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Изменить запись в электронной очереди.
// 
// Параметры:
//  ЗаписьВОчередь - ДокументСсылка.гкс_ЗаписьВОчередьПриемкиПЛК - 
//  ПараметрыИзменения - Структура - 
//
Процедура ИзменитьЗаписьВЭлектроннойОчереди(ЗаписьВОчередь, ПараметрыИзменения) Экспорт
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(ЗаписьВОчередь);
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru='Ошибка блокировки записи в очередь %1'"), Строка(ЗаписьВОчередь));
	КонецПопытки;
		
	ЗаписьВОчередьДокумент = ЗаписьВОчередь.ПолучитьОбъект();
	ЗаписьВОчередьДокумент.Заполнить(ПараметрыИзменения);
	
	Попытка
		ЗаписьВОчередьДокумент.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеКомплектаЗавершающихДокументовПоПриемке

Функция ПараметрыФормированияКомплектаДокументов(ДокументРегистрации, ПараметрыРегистрации)
		
	ПараметрыФормирования = ПараметрыФормированияКомплектаДокументовПоУмолчанию();
	
	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрации, 
	    "ТочкаМаршрута, ВидПеревозки, ТипРегистрации, Собственник, Организация, Внутригрупповой, Дата, Контрагент,
	    |НомерДокументаПоставщика, ДатаДокументаПоставщика, ТранспортноеСредство, Номенклатура,ВесНетто, Спецификация");
	        
	ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДанныеРегистрации);
	
	ПараметрыФормирования.ДатаДокумента = ДанныеРегистрации.Дата;
	ПараметрыФормирования.Грузополучатель = ДанныеРегистрации.Организация;
	ПараметрыФормирования.ЭтоПриемка = (ДанныеРегистрации.ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка);
	
	ПараметрыФормирования.Вставить("ЭтоАвтоперевозка", 
		ПараметрыФормирования.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль);
		
	ПараметрыФормирования.Вставить("ЭтоЖДперевозка", 
		ПараметрыФормирования.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт);                 
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыФормирования, ПараметрыРегистрации, Истина); 
	
	// попытка найти уже принятый композитный анализ
	ПереопределитьЛабораторныйАнализ(ДокументРегистрации, ПараметрыФормирования);
	
	Возврат ПараметрыФормирования;
	
КонецФункции

Процедура ПереопределитьЛабораторныйАнализ(ДокументРегистрации, ПараметрыФормирования)
	
	// для режима отправки лаб. анализа входного контроля переопределять анализ не нужно 
	Если гкс_ПриемкаТранспорта.ЭтоЛабораторныйАнализДляОснованияДвиженияЗапасов(
		ПараметрыФормирования.ЛабораторныйАнализ) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛабораторныйАнализ.Ссылка КАК АнализСсылка
	|ПОМЕСТИТЬ ВТ_ПоФормированиюПроб
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ЛабораторныйАнализ.гкс_ДокументРегистрации
	|			И (ЛабораторныйАнализ.Проведен)
	|			И (ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПриемкаКомпозит))
	|			И (ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = &ДокументРегистрацииНаПЛК)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛабораторныйАнализ.Ссылка КАК АнализСсылка
	|ПОМЕСТИТЬ ВТ_ПоРегистрации
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|ГДЕ
	|	ЛабораторныйАнализ.Проведен
	|	И ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПриемкаКомпозит)
	|	И ЛабораторныйАнализ.гкс_ДокументРегистрации = &ДокументРегистрацииНаПЛК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоРегистрации.АнализСсылка КАК КомпозитныйАнализ
	|ИЗ
	|	ВТ_ПоРегистрации КАК ВТ_ПоРегистрации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоФормированиюПроб.АнализСсылка
	|ИЗ
	|	ВТ_ПоФормированиюПроб КАК ВТ_ПоФормированиюПроб";
	
	Запрос.УстановитьПараметр("ДокументРегистрацииНаПЛК", ДокументРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПараметрыФормирования.Вставить("ЛабораторныйАнализ", ВыборкаДетальныеЗаписи.КомпозитныйАнализ);
	КонецЦикла;
			
КонецПроцедуры	

Функция ПараметрыФормированияКомплектаДокументовПоУмолчанию()
		
	СтруктураПараметровПоУмолчанию = Новый Структура;
	СтруктураПараметровПоУмолчанию.Вставить("Дата");
	СтруктураПараметровПоУмолчанию.Вставить("Организация");
	СтруктураПараметровПоУмолчанию.Вставить("ТочкаМаршрута");
	СтруктураПараметровПоУмолчанию.Вставить("ВидПеревозки");
	СтруктураПараметровПоУмолчанию.Вставить("ТипРегистрации");
	СтруктураПараметровПоУмолчанию.Вставить("Собственник");
	СтруктураПараметровПоУмолчанию.Вставить("Грузополучатель");
	СтруктураПараметровПоУмолчанию.Вставить("Внутригрупповой");
	СтруктураПараметровПоУмолчанию.Вставить("ДатаДокумента");
	СтруктураПараметровПоУмолчанию.Вставить("Контрагент");
	СтруктураПараметровПоУмолчанию.Вставить("ФактическийСклад");
	СтруктураПараметровПоУмолчанию.Вставить("ЭтоПриемка");
	СтруктураПараметровПоУмолчанию.Вставить("НомерДокументаПоставщика");
	СтруктураПараметровПоУмолчанию.Вставить("ДатаДокументаПоставщика");
	СтруктураПараметровПоУмолчанию.Вставить("ТранспортноеСредство");
	СтруктураПараметровПоУмолчанию.Вставить("Номенклатура");
	СтруктураПараметровПоУмолчанию.Вставить("Спецификация");
	
	СтруктураПараметровПоУмолчанию.Вставить("ЛабораторныйАнализ");
	СтруктураПараметровПоУмолчанию.Вставить("ПунктРазгрузки");
	
	СтруктураПараметровПоУмолчанию.Вставить("ВесНетто");
	СтруктураПараметровПоУмолчанию.Вставить("ВесНеттоФакт");
	СтруктураПараметровПоУмолчанию.Вставить("ВесБрутто");
	СтруктураПараметровПоУмолчанию.Вставить("ВесБруттоФакт");
	СтруктураПараметровПоУмолчанию.Вставить("ВесТары");
	СтруктураПараметровПоУмолчанию.Вставить("ВесТарыФакт");
	
	Возврат СтруктураПараметровПоУмолчанию;
	
КонецФункции

#Область ФормированиеТранспортногоДокумента

Процедура ЗаблокироватьТаблицуДокументовПриемкиПоРегистрации(ДокументРегистрации)
	
	Если Не ТранзакцияАктивна() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных();
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ДокументРегистрации", ДокументРегистрации);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаДанныеДляДетальныхЗаписей() 
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Регистрация.Ссылка КАК Ссылка,
	|	Регистрация.ВерсияДанных КАК ВерсияДанных,
	|	Регистрация.ПометкаУдаления КАК ПометкаУдаления,
	|	Регистрация.ТипРегистрации КАК ТипРегистрации,
	|	Регистрация.Номер КАК Номер,
	|	Регистрация.Дата КАК ДатаРегистрации,
	|	Регистрация.Проведен КАК Проведен,
	|	Регистрация.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Регистрация.Организация КАК Организация,
	|	Регистрация.ОтправительПолучатель КАК ОтправительПолучатель,
	|	Регистрация.Собственник КАК Собственник,
	|	Регистрация.Контрагент КАК Контрагент,
	|	Регистрация.Водитель КАК Водитель,
	|	Регистрация.Номенклатура КАК Номенклатура,
	|	Регистрация.НомерДокументаПоставщика КАК НомерТТН,
	|	Регистрация.ДатаДокументаПоставщика КАК ДатаДокументаПоставщика,
	|	Регистрация.ВесБрутто КАК ВесБруттоПоДокументам,
	|	Регистрация.ВесТары КАК ВесТарыПоДокументам,
	|	Регистрация.ВесНетто КАК ВесПоДокументам
	|ИЗ
	|	Документ.гкс_РегистрацияНаПЛК КАК Регистрация
	|ГДЕ
	|	Регистрация.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КачественныеПоказателиАнализа.Показатель КАК Показатель,
	|	КачественныеПоказателиАнализа.Значение КАК Значение,
	|	КачественныеПоказателиАнализа.СоответствуетНормативу КАК СоответствуетНормативу,
	|	КачественныеПоказателиАнализа.ОтклонениеОтБазиса КАК ОтклонениеОтБазиса,
	|	КачественныеПоказателиАнализа.гкс_Примечание КАК Примечание
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК КачественныеПоказателиАнализа
	|ГДЕ
	|	КачественныеПоказателиАнализа.Ссылка = &СсылкаАнализов";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
